# UndefinedTemperatureUnit Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..ConversionFailures..::..UndefinedTemperatureUnit Property
BuiltInFailures..::..ConversionFailures Class See Also
---
Undefined temperature unit: '[Temperature Unit Type Name]'
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId UndefinedTemperatureUnit { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property UndefinedTemperatureUnit As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ UndefinedTemperatureUnit {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..ConversionFailures Class
Autodesk.Revit.DB Namespace